In [45]:
# import modules and libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [46]:
data = pd.read_csv('car_data.csv')
data.head(10)

                                        name    price   mileage
0                         1999 HONDA CR-V LX    $ 950  284394.0
1                         2002 ISUZU RODEO S    $ 850  148883.0
2  2002 HYUNDAI SANTA FE GLS/LX Wagon 4 Door  $ 1,000  238042.0
3                  1991 CHEVROLET GMT-400 K1    $ 500  207094.0
4                  1996 CHEVROLET GMT-400 C1    $ 800  176638.0
5           2003 HONDA CIVIC EX Sedan 4 Door    $ 650  183295.0
6                        2002 ISUZU AXIOM XS    $ 750  218217.0
7                      2003 HONDA CIVIC HYBR    $ 850  106623.0
8          1999 HONDA ACCORD EX Sedan 4 Door    $ 550  284850.0
9                        1995 HONDA CIVIC DX    $ 600  117312.0

In [47]:
data.shape

(2401, 3)

In [48]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2401 entries, 0 to 2400
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     2401 non-null   object
 1   price    2401 non-null   object
 2   mileage  2401 non-null   float64
dtypes: float64(1), object(2)
memory usage: 56.4+ KB

In [49]:
data['model'] = data['name'].apply(lambda x: x.split(' ')[1])
data['model'].head()

0        HONDA
1        ISUZU
2      HYUNDAI
3    CHEVROLET
4    CHEVROLET
Name: model, dtype: object

In [50]:
data['year'] = data['name'].apply(lambda x: x.split(' ')[0])
data['year'].head()

0    1999
1    2002
2    2002
3    1991
4    1996
Name: year, dtype: object

In [51]:
data.head()

,name,price,mileage,model,year
0,1999 HONDA CR-V LX,$ 950,284394.0,HONDA,1999
1,2002 ISUZU RODEO S,$ 850,148883.0,ISUZU,2002
2,2002 HYUNDAI SANTA FE GLS/LX Wagon 4 Door,"$ 1,000",238042.0,HYUNDAI,2002
3,1991 CHEVROLET GMT-400 K1,$ 500,207094.0,CHEVROLET,1991
4,1996 CHEVROLET GMT-400 C1,$ 800,176638.0,CHEVROLET,1996

In [52]:
data['price'] = data['price'].apply(lambda x: x.split(' ')[1])
data['price'].head()

0      950
1      850
2    1,000
3      500
4      800
Name: price, dtype: object

In [53]:
data['price'] = data['price'].str.replace(',', '')
data['price'].head()

0     950
1     850
2    1000
3     500
4     800
Name: price, dtype: object

In [56]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2401 entries, 0 to 2400
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     2401 non-null   object
 1   price    2401 non-null   float64
 2   mileage  2401 non-null   float64
 3   model    2401 non-null   object
 4   year     2401 non-null   object
dtypes: float64(2), object(3)
memory usage: 93.9+ KB

In [55]:
data['price'] = data['price'].astype(float)